import { zhTran2Simp } from './zhTran2Simple.js'

export const reviseName = (name) => {
  if (!name) return '';

  name = (name + '').replace(/\s/g, '');
  name = name.replace(/[.]/g, '·');
  name = name.replace(/[^\u3400-\u9FFF𤣩·•]/g, '');
  name = name.replace(/^[·•]+|[·•]+$/g, '');
  name = zhTran2Simp(name); // 繁体转简体
  const familyNames = {
    '弓长': '张',
    '彳佘': '徐',
    '冫马': '冯',
    '口十': '叶',
    '讦': '许',
    '𤣩': '王',
    '口玉': '国',
    '廴聿': '建',
    '冖车': '军',
    '⻗叚': '霞',
    '雨叚': '霞',
    '礻畐': '福',
    '冈刂': '刚',
    '王令': '玲',
    '𤣩令': '玲',
    '玪': '玲',
    '人玉': '金',
    '八玉': '金',
    '入玉': '金',
    '扌辰': '振',
  };
  for (let key of Object.keys(familyNames)) {
    if (name.startsWith(key)) {
      name = name.replace(key, familyNames[key]);
      break;
    }
  }

  name = name.replace(/[丨丶忄冫彳乚讠丿]/g, '');
  name = name.replace(/[亻⻖阝氵氺⻌宀冖纟乛亠疒匚⻊艹⺮攵扌刂]/g, '');
  name = name.replace(/^[一二三四五六七八九十]+月/g, '');
  name = name.replace(/(家人|父母|父|母|父亲|母亲|爸爸|妈妈|爸|妈|爱人|老伴|丈夫|老公|先生|妻子|老婆|媳妇|婆娘|太太|孩子|宝宝|儿女|儿子|大儿|小儿|女儿|闺女|姑娘)/g, '');
  if (name.length > 3) {
    name = name.replace(/^.+(省|市|自治区|自治州|县|区|).*/g, '');
  }
  name = name.replace(/^[一十丫了去在卅我你姓名]+/g, '');
  // name = name.replace(/(.+)\1+/, '$1');

  return name;
}

const testNameList = [
  // '弓长', '彳佘', '冫马', '口十', '讦', '𤣩',
  // '张诗|忄台', '王乒丶', '冫水冫夌', '帆乚', '讠十算訁十算', '九丿乙',
  // '一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十',
  // '一十丫了去在卅我你姓名一十丫了去在卅我你姓名一十丫了去在卅我你姓名',
  // '仁亻二', '郑关⻖', '陈阝东', '清氵青', '水氺', '过⻌寸', '宝宀玉', '军冖车', '红纟工', '买乛头', '亮亠口几', '疾疒矢', '匡匚王', '跳⻊兆', '草艹早', '第⺮弟', '牧牛攵',
  // '你好',
  // '你好你好',
  // '熊二熊二熊二熊二熊二熊二',
  // '啊哈哈啊哈哈啊哈哈',
  // '1张三丰2张三丰3张三丰4张三丰5张三丰6',
  // '1李四个字2李四个字3李四个字4李四个字5',
  // '1王五个汉字2王五个汉字3王五个汉字4王五个汉字5',
  // '张三丰孩子',
  // '张三丰孩子儿子',
  // '五月天',
  // '十月天',
  // '十一月天',
  // '十二月天',
  // '十三月天',
  // '月亮',
  // '寒冬腊月',
  // '1月',
  // '12月',
  // '13月',
  // '很好9月1号',
  // '张一月',
  // '一月张一月',
  '张三江苏省',
  '江省张三',
  '张三江苏省苏州市',
  '江苏省苏州市张三',
  '内蒙古自治区李四',
  '新疆维吾尔自治区乌鲁木齐市天山区中山路479号',
  '新疆维吾尔自治区乌鲁木齐市天山区中山路479号张三',
  '张省',
  '张省省',
  '张省省省',
  '张省省省省',
]

testNameList.forEach((name) => {
  console.log(name, '>>>', reviseName(name))
})
